БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыHTML/ПараметрыHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПараметрыHTML</name>
  <type>
    <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтрокиЭМКНеограниченнойДлины</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.РеестрМедицинскихОрганизаций</types>
    <types>DocumentRef.Прием</types>
    <types>CatalogRef.ИнструментальныеИсследования</types>
    <types>CatalogRef.ДействующиеВеществаЛекарственныхПрепаратов</types>
    <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    <types>Boolean</types>
    <types>CatalogRef.СоглашенияСтрахования</types>
    <types>CatalogRef.Клиенты</types>
    <types>CatalogRef.Филиалы</types>
    <types>DocumentRef.ДоговорСКлиентом</types>
    <types>CatalogRef.СтраховыеПолисы</types>
    <types>String</types>
    <types>CatalogRef.Диагнозы</types>
    <types>CatalogRef.Сотрудники</types>
    <types>Date</types>
    <types>CatalogRef.КатегорииВыработки</types>
    <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
    <types>CatalogRef.ЛабораторныеТесты</types>
    <types>Number</types>
    <types>CatalogRef.МедицинскоеОборудование</types>
    <types>CatalogRef.ВидыМедицинскихДокументов</types>
    <types>CatalogRef.КлассификаторыМинЗдрава</types>
    <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    <numberQualifiers>
      <precision>18</precision>
      <scale>4</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПрофпатологДополнениеКЗаключению</name>
      <description>Профпатолог: Дополнение к заключению</description>
      <code>000000005</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологЗаключение</name>
      <description>Профпатолог: Заключение</description>
      <code>000000001</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологИнфекционныйАнамнез</name>
      <description>Профпатолог: Инфекционный анамнез</description>
      <code>000000004</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологРекомендации</name>
      <description>Профпатолог: Рекомендации</description>
      <code>000000002</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПрофпатологСведенияОПрививках</name>
      <description>Профпатолог: Сведения о прививках</description>
      <code>000000003</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВычисляемыеЗначенияПараметров</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.РеестрМедицинскихОрганизаций</types>
      <types>CatalogRef.ИнструментальныеИсследования</types>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
      <types>Boolean</types>
      <types>CatalogRef.СоглашенияСтрахования</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.СтраховыеПолисы</types>
      <types>String</types>
      <types>CatalogRef.Диагнозы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>Date</types>
      <types>CatalogRef.КатегорииВыработки</types>
      <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
      <types>CatalogRef.ЛабораторныеТесты</types>
      <types>Number</types>
      <types>CatalogRef.МедицинскоеОборудование</types>
      <types>CatalogRef.ВидыМедицинскихДокументов</types>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВычисляемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗаполняетсяПредыдущимиЗначениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноДляЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПрофпатологом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРедактируетсяПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыборПоСсылкеИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводВручнуюПриВыбореИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлассификатора</name>
    <type>
      <types>EnumRef.ВидыКлассификаторовМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнятьГотовымиФразамиВыборИзОграниченногоСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.КодировкаПолейЭМД</types>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПакетыСоставныхФраз</name>
    <attributes>
      <name>Пакет</name>
      <type>
        <types>CatalogRef.ПакетыСоставныхФраз</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияВыбора</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоГруппа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>String</types>
        <types>Number</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/CommonModules/РаботаСШаблонамиОбработкамиСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьОбработчикиАвтоВыбораРеквизитов(Объект, ЭтаФорма, Параметры, ИмяОбработчика) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	Для Каждого Реквизит Из ПолучитьРеквизитыФормы(Объект, ЭтаФорма) Цикл
		
		Если ТипЗнч(Реквизит.Значение) = Тип("Строка") Тогда
			Параметр = ПолучитьПараметр(Реквизит.Ключ, Параметры);
			
			Если ЗначениеЗаполнено(Параметр) Тогда
				РедактированиеТекста = Не Параметр.ВыборПоСсылкеИзОграниченногоСписка Или Параметр.РазрешитьВводВручнуюПриВыбореИзОграниченногоСписка;
										 
				Если Параметр.ВыборПоСсылкеИзОграниченногоСписка Тогда
					Элемент = Элементы.Найти(Реквизит.Ключ);
					Если Элемент <> Неопределено Тогда
						Элемент.УстановитьДействие("АвтоПодбор", ИмяОбработчика);
						Элемент.КнопкаВыпадающегоСписка = Истина;
						Элемент.КнопкаОчистки = Истина;
						Элемент.РедактированиеТекста = РедактированиеТекста;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьОбработчикиАвтоВыбораТаблицШаблонов(Объект, ЭтаФорма, Параметры, ИмяОбработчика) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	Для Каждого Таблица Из ПолучитьРеквизитыТаблицШаблоновФормы(Объект, ЭтаФорма) Цикл
		
		ТЧ = Объект[Таблица.Ключ];
		ТЗ = ТЧ.Выгрузить();
		
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			
			Параметр = ПолучитьПараметрТаблицыШаблона(Колонка.Имя, Параметры);
			
			РедактированиеТекста = (ЗначениеЗаполнено(Параметр)
									И (Параметр.ВыборПоСсылкеИзОграниченногоСписка
									И Параметр.РазрешитьВводВручнуюПриВыбореИзОграниченногоСписка 
									Или Не Параметр.ВыборПоСсылкеИзОграниченногоСписка) 
									Или Не ЗначениеЗаполнено(Параметр)
									);
			
			КнопкаВыпадающегоСписка = ЗначениеЗаполнено(Параметр) И Параметр.ВыборПоСсылкеИзОграниченногоСписка;
			
			Элемент = Элементы.Найти(Колонка.Имя);
			Если Элемент <> Неопределено Тогда
				Элемент.УстановитьДействие("АвтоПодбор", ИмяОбработчика);
				Элемент.КнопкаВыпадающегоСписка = КнопкаВыпадающегоСписка;
				Элемент.КнопкаОчистки = Истина;
				Элемент.РедактированиеТекста = РедактированиеТекста;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПараметр(ЭлементИмя, Параметры) Экспорт
	
	СтрокаТЧ = Параметры.ШаблонПриема.СоответствияПараметрам.Найти(ЭлементИмя, "Наименование");
	Параметр = ?(ЗначениеЗаполнено(СтрокаТЧ), СтрокаТЧ.Параметр, Неопределено);
	
	Возврат Параметр;
	
КонецФункции

Функция ПолучитьПараметрТаблицыШаблона(ЭлементИмя, Параметры) Экспорт
	
	СтрокаТЧ = Параметры.ШаблонПриема.СоответствияТаблицамШаблонов.Найти(ЭлементИмя, "Представление");
	Параметр = ?(ЗначениеЗаполнено(СтрокаТЧ), СтрокаТЧ.Параметр, Неопределено);
	
	Возврат Параметр;
	
КонецФункции

Функция ПолучитьТаблицуОбработкиПараметра(ЭлементИмя, Параметры) Экспорт
	
	СтрокаТЧ = Параметры.ШаблонПриема.СоответствияТаблицамШаблонов.Найти(ЭлементИмя, "Представление");
	Таблица = ?(ЗначениеЗаполнено(СтрокаТЧ), СтрокаТЧ.ТаблицаОбработки, Неопределено);
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьРеквизитыФормы(Объект, ЭтаФорма) Экспорт
	
	РеквизитыФормы = Новый Структура;
	Для Каждого Стр Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Стр.Имя = "Объект" Тогда
			Продолжить;
		КонецЕсли;
		РеквизитыФормы.Вставить(Стр.Имя, Объект[Стр.Имя]);
	КонецЦикла;
	
	Возврат РеквизитыФормы;
	
КонецФункции

Функция ПолучитьРеквизитыТаблицШаблоновФормы(Объект, ЭтаФорма) Экспорт
	
	ТаблицыПриемов = Новый Структура;
	
	Для Каждого Стр Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Стр.Имя = "ТаблицаПараметров" Или Стр.Имя = "Объект" Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.ТипЗначения = Новый ОписаниеТипов("ТаблицаЗначений") Тогда
			ТЧ = Объект[Стр.Имя];
			ТЗ = ТЧ.Выгрузить();
			РеквизитыТаблицы = Новый Структура;
			Для Каждого Колонка Из ТЗ.Колонки Цикл
				РеквизитыТаблицы.Вставить(Колонка.Имя, Колонка.ТипЗначения.Типы()[0]);
			КонецЦикла;
			ТаблицыПриемов.Вставить(Стр.Имя, РеквизитыТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицыПриемов;
	
КонецФункции

Процедура СходитьНаСервер() Экспорт
	
КонецПроцедуры

Функция ПолучитьДеревоЗначенийВыбораПараметраФорма(Параметр) Экспорт
	
	Возврат ПланыВидовХарактеристик.ПараметрыHTML.ПолучитьДеревоЗначенийВыбораПараметра(Параметр);
	
КонецФункции

Процедура ЗаполнитьСоответствиеПараметрам(Объект, СоответствияПараметрам, ПараметрыШаблона) Экспорт
	
	Параметры = ПараметрыШаблона.ШаблонПриема.СоответствияПараметрам.Выгрузить();
	ПараметрыДТ = ПараметрыШаблона.ШаблонПриема.СоответствияТаблицамШаблонов.Выгрузить();
	
	СоответствияПараметрам.Загрузить(Параметры);
	
	Для Каждого СтрокаТЗ Из ПараметрыДТ Цикл
		Строка = СоответствияПараметрам.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаТЗ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Параметры", СоответствияПараметрам.Выгрузить(,"Параметр").ВыгрузитьКолонку("Параметр"));
	Запрос.Текст = "ВЫБРАТЬ
				|	ВыборПоСсылкеИзОграниченногоСписка КАК ВыборПоСсылкеИзОграниченногоСписка,
				|	Ссылка КАК Параметр
				|ИЗ
				|	ПланВидовХарактеристик.ПараметрыHTML КАК ПараметрыHTML
				|ГДЕ
				|	Ссылка В(&Параметры)";
	Выборка = Запрос.Выполнить().Выбрать();
	Отбор = Новый Структура("Параметр");
	
	Для Каждого СтрокаПараметр Из СоответствияПараметрам Цикл
		Отбор.Параметр = СтрокаПараметр.Параметр;
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Отбор) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПараметр, Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьФорматнуюСтрокуПараметра(ПараметрШаблона) Экспорт
	Возврат ПараметрШаблона.ФорматнаяСтрока;
КонецФункции

// Возвращает табличную часть соответствия парамтеров шаблона обработки.
//
// Параметры:
//  ШаблонПриема	 - СправочникСсылка.ШаблоныHTML	 - Шаблон приема.
//  ВернутьМассив	 - Булево - Преобразовать таблицу результата в массив структур.
// 
// Возвращаемое значение:
//   ТаблицаЗначений, Массив.
//
Функция ПолучитьСоответствиеПараметровОбработки(ШаблонПриема, ПараметрыТаблицШаблонов = Ложь, ВернутьМассив = Ложь) Экспорт
	
	ИмяТабличнойЧасти = ?(ПараметрыТаблицШаблонов,"СоответствияТаблицамШаблонов","СоответствияПараметрам");
	
	ТаблицаСоответствий = ШаблонПриема[ИмяТабличнойЧасти];
	
	Если ВернутьМассив Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаСоответствий.Выгрузить());
	Иначе
		Возврат ТаблицаСоответствий;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеЗаполненияПоПредыдущемуПриему(ЭтаФорма) Экспорт
	
	СтруктураШапки = ЭтаФорма.Параметры.СтруктураШапки;
	ШаблонПриема = ЭтаФорма.Параметры.ШаблонПриема;
	
	СоответствиеРеквизитамЭлементов = Новый Соответствие;
	Элементы = ЭтаФорма.Элементы;
	Для Каждого Элемент Из Элементы Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "ПутьКДанным") Тогда
			СоответствиеРеквизитамЭлементов.Вставить(Элемент.ПутьКДанным, Элемент.Имя);
		КонецЕсли;
	КонецЦикла;
	
	СписокЗаполнений = Новый Массив;
	СоответствиеПараметровРеквизитам = Новый Соответствие;
	ТаблицаПараметровШаблона = ОбщегоНазначенияКлиентСервер.ТаблицуЗначенийВМассивСтруктур(ШаблонПриема.СоответствияПараметрам.Выгрузить());
	Для Каждого Строка Из ТаблицаПараметровШаблона Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, Строка.Представление) Тогда
			СписокЗаполнений.Добавить(Строка.Параметр);
			СоответствиеПараметровРеквизитам.Вставить(Строка.Параметр, Строка.Представление);
		КонецЕсли;
	КонецЦикла;
	
	СписокЗаполненийТаблиц = Новый Массив;
	СоответствиеТаблиц = Новый Соответствие;
	СоответствиеПараметровТаблицРеквизитам = Новый Соответствие;
	
	ТаблицаПараметровТаблицШаблона = ОбщегоНазначенияКлиентСервер.ТаблицуЗначенийВМассивСтруктур(ШаблонПриема.СоответствияТаблицамШаблонов.Выгрузить());
	
	СтруктураКолонокТаблицОбработки = Новый Структура;
	
	мОбрИнд = ТаблицаПараметровТаблицШаблона.Количество()-1;
	Для Сч = 0 По мОбрИнд Цикл
		СтрокаТЗ = ТаблицаПараметровТаблицШаблона[мОбрИнд-Сч];
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, СтрокаТЗ.ТаблицаОбработки) Тогда
			
			Если СтруктураКолонокТаблицОбработки.Свойство(СтрокаТЗ.ТаблицаОбработки) Тогда
				КолонкиТаблицОбработки = СтруктураКолонокТаблицОбработки[СтрокаТЗ.ТаблицаОбработки];
			Иначе
				СтруктураКолонокТаблицОбработки.Вставить(СтрокаТЗ.ТаблицаОбработки, ЭтаФорма[СтрокаТЗ.ТаблицаОбработки].Выгрузить().Колонки);
				КолонкиТаблицОбработки = СтруктураКолонокТаблицОбработки[СтрокаТЗ.ТаблицаОбработки];
			КонецЕсли;
			
			Если КолонкиТаблицОбработки.Найти(СтрокаТЗ.Представление) <> Неопределено Тогда
				СписокЗаполненийТаблиц.Добавить(СтрокаТЗ.Параметр);
				СоответствиеТаблиц.Вставить(СтрокаТЗ.ТаблицаШаблонов, СтрокаТЗ.ТаблицаОбработки);
				СоответствиеРеквизитовТаблиц = СоответствиеПараметровТаблицРеквизитам.Получить(СтрокаТЗ.ТаблицаОбработки);
				Если СоответствиеРеквизитовТаблиц = Неопределено Тогда
					СоответствиеРеквизитовТаблиц = Новый Соответствие;
				КонецЕсли;
				СоответствиеРеквизитовТаблиц.Вставить(СтрокаТЗ.Параметр, СтрокаТЗ.Представление);
				СоответствиеПараметровТаблицРеквизитам.Вставить(СтрокаТЗ.ТаблицаОбработки, СоответствиеРеквизитовТаблиц);
			Иначе
				ТаблицаПараметровТаблицШаблона.Удалить(мОбрИнд-Сч);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	МедКарта = СтруктураШапки.МедицинскаяКарта;
	ДокументПриема = СтруктураШапки.Ссылка;
	
	ЗначенияПредыдущегоОсмотра = ОбщегоНазначенияКлиентСервер.ТаблицуЗначенийВМассивСтруктур(УправлениеОбработкамиШаблоновСервер.СформироватьЗначенияПредыдущегоОсмотра(МедКарта, ДокументПриема, СписокЗаполнений, Истина));
	
	МассивТаблиц = Новый Массив;
	Для Каждого Соответствие Из СоответствиеТаблиц Цикл
		МассивТаблиц.Добавить(Соответствие.Ключ);
	КонецЦикла;
	
	Если СписокЗаполненийТаблиц.Количество() > 0 Тогда
		ЗначенияТаблицПредыдущегоОсмотра = ОбщегоНазначенияКлиентСервер.ТаблицуЗначенийВМассивСтруктур(УправлениеОбработкамиШаблоновСервер.СформироватьЗначенияТаблицПредыдущегоОсмотра(МедКарта, ДокументПриема, СписокЗаполненийТаблиц, Истина, МассивТаблиц, ШаблонПриема));
		Для Каждого Строка Из ЗначенияТаблицПредыдущегоОсмотра Цикл
			Если СоответствиеТаблиц.Получить(Строка.ТаблицаШаблонов) <> Неопределено Тогда
				Строка.Вставить("ТаблицаОбработки", СоответствиеТаблиц.Получить(Строка.ТаблицаШаблонов));
				СоответствиеРеквизитовТаблиц = СоответствиеПараметровТаблицРеквизитам.Получить(Строка.ТаблицаОбработки);
				Строка.Вставить("Реквизит", СоответствиеРеквизитовТаблиц.Получить(Строка.Параметр));
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗначенияТаблицПредыдущегоОсмотра = Новый Массив;
		СоответствиеПараметровТаблицРеквизитам = Новый Соответствие;
	КонецЕсли;
	
	Возврат Новый Структура("СоответствиеРеквизитамЭлементов, СоответствиеПараметровРеквизитам, ЗначенияПредыдущегоОсмотра, СоответствиеПараметровТаблицРеквизитам, ЗначенияТаблицПредыдущегоОсмотра",
							СоответствиеРеквизитамЭлементов, СоответствиеПараметровРеквизитам, ЗначенияПредыдущегоОсмотра, СоответствиеПараметровТаблицРеквизитам, ЗначенияТаблицПредыдущегоОсмотра);
	
КонецФункции

Функция ПолучитьСтруктуруПараметровРеквизитовФормы()
	Возврат Новый Структура;
КонецФункции

#КонецОбласти
